app/views/questions/_question.html.erb

SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = ? LIMIT ?  [["question_id", 12], ["LIMIT", 1]]
---
	</div>
	<%= if question.answer.present?