app/controllers/answers_controller.rb

INSERT INTO "answers" ("title", "content", "question_id", "created_at", "updated_at", "dealing_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", ""], ["content", "character is 123"], ["question_id", 22], ["created_at", 2016-10-26 16:44:05 UTC], ["updated_at", 2016-10-26 16:44:05 UTC], ["dealing_id", 3]]
---
  def create
    @answer = Answer.new(answer_params)

    respond_to do |format|
      if @answer.save

UPDATE "answers" SET "category" = ?, "content" = ?, "confidence" = ?, "updated_at" = ? WHERE "answers"."id" = ?  [["category", "1"], ["content", "testing out training when an administrator marks123 something "], ["confidence", 0.5648041719219788], ["updated_at", 2016-11-02 22:26:07 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @answer.update(answer_params)

SELECT  "dealings".* FROM "dealings" WHERE "dealings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_dealing
      @dealing = Dealing.find(params[:answer][:dealing_id])