app/controllers/dealings_controller.rb

SELECT "factors".* FROM "factors"
---
  def create
    @dealing = Dealing.new(dealing_params)

    #add all factors
    Factor.all.each do |f|