app/controllers/dealings_controller.rb

SELECT "dealings".* FROM "dealings"
---
  def index
    @dealings = Dealing.all

INSERT INTO "dealings" ("due_date", "created_at", "updated_at", "status", "category") VALUES (?, ?, ?, ?, ?)  [["due_date", Thu, 27 Oct 2016], ["created_at", 2016-10-27 19:09:43 UTC], ["updated_at", 2016-10-27 19:09:43 UTC], ["status", "In Progress"], ["category", "Unknown"]]
INSERT INTO "factors" ("created_at", "updated_at", "title", "content", "factor_type") VALUES (?, ?, ?, ?, ?)  [["created_at", 2016-11-03 19:55:49 UTC], ["updated_at", 2016-11-03 19:55:49 UTC], ["title", "Factor 1"], ["content", "Purpose of the dealing."], ["factor_type", "FACTOR1"]]
INSERT INTO "questions" ("title", "content", "created_at", "updated_at", "question_type") VALUES (?, ?, ?, ?, ?)  [["title", "Question 1"], ["content", "What is the purpose of the dealing?"], ["created_at", 2016-11-02 23:50:14 UTC], ["updated_at", 2016-11-02 23:50:14 UTC], ["question_type", "QUESTION1"]]
---
  def create
    @dealing = Dealing.new(dealing_params)

    #set status and category
    @dealing.status = "In Progress"
    @dealing.category = "Unknown"

    respond_to do |format|
      if @dealing.save
        logger.info "Dealing was successfully created."

        #this is ugly as hell
        @dealing.factors.create( title: "Factor 1", content: "Purpose of the dealing", factor_type: "FACTOR1" ).questions.create( title: "Question 1", content: "Describe the purpose of the dealing? <br>i.e. research, private study, education, parody, satire, criticism, review or news reporting), including whether it is commercial.", question_type: "QUESTION1" )

DELETE FROM "dealings" WHERE "dealings"."id" = ?  [["id", 1]]
---
  def destroy
    @dealing.destroy

SELECT  "dealings".* FROM "dealings" WHERE "dealings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_dealing
      @dealing = Dealing.find(params[:id])