app/controllers/factors_controller.rb

SELECT "factors".* FROM "factors"
---
  def index
    @factors = Factor.all

SELECT  "factors".* FROM "factors" WHERE "factors"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_factor
      @factor = Factor.find(params[:id])